%采用主频为30Hz的零相位Ricker形子波，利用褶积法计算出理论单道地震信号，进行有限离散傅里叶变换
f=30;%子波中心频率为30HZ
r=4;%子波宽度为4
h=[200,300,130,70,600];%地层厚度
v=[1500,2000,3000,2100,4300];%各地层对应速度
t=2.*h./v;%波在各地层中的传播时间
t1=t(1)+t(2)+t(3)+t(4)+t(5);%波在地层中传播的总时间
dt=0.001;%采样间隔为1ms
n=t1/dt;%采样点数
k=1:n;
figure(1);
w=exp((-1)*(2*pi*f/r).^2*(dt*k).^2).*cos(2*pi*f.*(dt*k));%零相位雷克子波
plot(w);
title('零相位雷克子波');
axis([0 200 -1 1]);

% %计算反射系数
% p=[1.0,2.4,2.4,2.3,2.1];%各地层对应密度
% for i=1:4
% m(i)=(p(i+1)*v(i+1)-p(i)*v(i))/(p(i)*v(i)+p(i+1)*v(i+1));
% end
% for j=1:1300
%     d(j)=0;
% end
% d(200)=m(1);
% d(500)=m(2);
% d(630)=m(3);
% d(700)=m(4);
% z=[200,500,630,700];
% r=[d(200),d(500),d(630),d(700)];
% figure(2);
% %stem(z,r);
% plot(d);
% title('初始反射系数');
% axis([0 1000 -1 1]);
% 
% %合成单道地震记录
% x=conv(w,d);%合成单道地震记录
% figure(3);
% plot(x);
% title('合成的单道地震记录');
% axis([0 1000 -1 1]);
% 
% n1=length(w);
% n2=length(d);
% n3=n1+n2;
% 
% %直接反褶积法求反射系数
% X=fft(x,n3-1);
% W0=fft(w,n3-1);
% R1=X./W0;
% r1=ifft(R1);
% figure(4);
% plot(real(r1(1:n2)));
% axis([0 1000 -1 1]);
% title('直接褶积得到的反射系数');
% figure(5);
% q=1:n2;
% plot(q,d,'r',q,real(r1(1:n2)),'g');
% title('反褶积得到的反射系数');
% legend('初始反射系数','直接反褶积得到的反射系数');
% axis([0 1000 -1 1]);
% 
% %%%
% 
% %对数分解法求取子波之后反演求取反射系数
% W=fft(w,n3-1);
% X=fft(x,n3-1);
% %对频率域的合成记录取对数后进行傅里叶逆变换求出其相应的时间序列（对数谱序列）
% s=ifft(log(X));
% %对对数谱序列在时间轴上进行低通滤波
% h=zeros(1,n3-1);%低通滤器
% for i=1:10 %门限时间为10
%     h(i)=1;
% end
% for i=1:n3-1
%     y(i)=h(i)*s(i);
% end
% a=fft(y);%对时间域子波的对数谱傅里叶变换求出频率域的子波对数谱
% W1=10.^exp(a);%对对数谱取指数得到子波频谱（%%%取错了！%%%）
% w1=ifft(W1);%对频谱进行逆变换得到时域子波
% figure(6);
% plot(real(w1(1:n1)));
% title('对数分解法得到的子波');
% axis([0 200 -1 1]);
% figure(7);
% plot(k,w,'g',k,real(w1(1:n1)),'r');
% legend('原始子波','计算得的子波');
% title('对数谱分解法得到的子波与原始子波对比');
% axis([0 200 -1 1]);
% 
% %%%%%%%%
% 
% %反褶积求取反射系数序列
% X=fft(x,n3-1);
% W2=fft(w1,n3-1);
% R=X./W2;
% r2=ifft(R);
% figure(8);
% plot(real(r2(1:n2)));
% axis([0 1000 -1 1]);
% title('求得的反射系数');
% figure(9);
% q=1:n2;
% plot(q,d,'g',q,real(r2(1:n2)),'r');
% axis([0 1000 -1 1]);
% legend('原始反射系数','计算得的反射系数');
% title('原始反射系数与求得反射系数的对比');
% 
% 
% 
% 
% 
% 
% 
% 
% 
